In [1]:
import sqlalchemy
from sqlalchemy import create_engine
import sys
sys.path.append('../')
import pandas as pd
import matplotlib.pyplot as plt

from postgres import username, password

In [2]:
user=username
password=password
PH_input='PH-Employees.sql'
engine = create_engine('postgresql://'+user+':'+password+'@localhost:5432/PH_db')

In [3]:
conn=engine.connect()

In [ ]:
title_df=pd.read_sql("SELECT * FROM titles",conn)
title_df.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [ ]:
salaries_df=pd.read_sql("SELECT * FROM salaries",conn)
salaries_df.head()

   emp_no   salary   from_date     to_date
0   10001  60117.0  1986-06-26  1987-06-26
1   10002  65828.0  1996-08-03  1997-08-03
2   10003  40006.0  1995-12-03  1996-12-02
3   10004  40054.0  1986-12-01  1987-12-01
4   10005  78228.0  1989-09-12  1990-09-12

In [ ]:
title_salaries=salaries_df.merge(title_df, on = ["emp_no"])
title_salaries.groupby("title", as_index=False).mean()

                title         emp_no        salary
0  Assistant Engineer  251495.398533  48493.204786
1            Engineer  252943.159987  48539.781423
2             Manager  110780.833333  51531.041667
3     Senior Engineer  253034.375949  48506.751806
4        Senior Staff  253423.367183  58503.286614
5               Staff  253399.240672  58465.271904
6    Technique Leader  251708.951052  48580.505772

In [ ]:
plt.bar(title_salaries["title"],title_salaries["salary"])
plt.show()